CompositeAchat/test/TestCasePresta/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:new="newEventBonAchat_iep">
  <soapenv:Body>
    <new:RecordsBatch_MsgObj>
      <!--Zero or more repetitions:-->
      <Records_MsgObj>
        <Id>1</Id>
        <Name>Wang</Name>
        <Email>wang@hotmail.com</Email>
        <Achat>Macpro</Achat>
        <Shop>Presta</Shop>
      </Records_MsgObj>
      <Records_MsgObj>
        <Id>3</Id>
        <Name>Wang</Name>
        <Email>wang@hotmail.com</Email>
        <Achat>Macpro1</Achat>
        <Shop>Presta</Shop>
      </Records_MsgObj>
      <Records_MsgObj>
        <Id>2</Id>
        <Name>Wang</Name>
        <Email>wang@hotmail.com</Email>
        <Achat>Macpro1</Achat>
        <Shop>Presta</Shop>
      </Records_MsgObj>
    </new:RecordsBatch_MsgObj>
  </soapenv:Body>
</soapenv:Envelope>